app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
WHERE `id` = '1'
 LIMIT 1
---
    public function update($idCliente)
    {
        if ($this->request->is('put')){
            $data = [
                'id_cliente' => $this->request->getVar('id_cliente'),
                'identidad' => $this->request->getVar('identidad'),
                'num_identidad' => $this->request->getVar('num_identidad'),
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'telefono' => $this->request->getVar('telefono'),
                'whatsapp' => $this->request->getVar('whatsapp'),
                'correo' => $this->request->getVar('correo'),
                'direccion' => $this->request->getVar('direccion')
            ];
            if ($this->clientes->update($idCliente, $data) === false) {
                $data['errors'] = $this->clientes->errors();
                $data['cliente'] = $this->clientes->where('id', $idCliente)->first();