app/Controllers/LoginController.php

    public function validar()
    {
        $this->reglas = [
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'El campo correo es requerido',
                    'valid_email' => 'Ingrese un correo valido',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'El campo contraseña es requerido'
                ]
            ]
        ];
        if ($this->request->is('post') && $this->validate($this->reglas)) {
            $result = $this->usuarios->where([
                    'correo' => $this->request->getVar('email'),
                    'estado' => '1',
                ])->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'angel.tapia78910@gmail.com'
AND `estado` = '1'
 LIMIT 1