app/Controllers/PrestamosController.php

    public function create()
    {
        if ($this->request->is('post') && verificar('nuevo prestamo', $this->session->permisos)) {
            $fecha = date('Y-m-d');
            //calcular vencimiento
            if ($this->request->getVar('modalidad') === 'DIARIO') {
                $fecha_venc = date('Y-m-d', strtotime($fecha . '+1 days'));
            } else if ($this->request->getVar('modalidad') === 'SEMANAL') {
                $fecha_venc = date('Y-m-d', strtotime($fecha . '+7 days'));
            } else if ($this->request->getVar('modalidad') === 'MENSUAL') {
                $fecha_venc = date('Y-m-d', strtotime($fecha . '+1 month'));
            } else {
                $fecha_venc = date('Y-m-d', strtotime($fecha . '+1 year'));
            }
            $data = [
                'cliente' => $this->request->getVar('cliente'),
                'importe' => $this->request->getVar('importe_credito'),
                'modalidad' => $this->request->getVar('modalidad'),
                'tasa_interes' => $this->request->getVar('tasa_interes'),
                'cuotas' => $this->request->getVar('cuotas'),
                'fecha' => date('Y-m-d H:i:s'),
                'fecha_venc' => $fecha_venc,
                'estado' => '1',
                'id_cliente' => $this->request->getVar('id_cliente'),
                'id_usuario' => $this->session->id_usuario
            ];
            //verificar cliente
            $sqlCliente = $this->prestamos->where([
                'id_cliente' => $this->request->getVar('id_cliente'),
                'estado' => '1',
            ])->first();
---
SELECT *
FROM `prestamos`
WHERE `id_cliente` = '1'
AND `estado` = '1'
 LIMIT 1

    public function detail($id)
    {
        if (!verificar('ver prestamo', $this->session->permisos)) {
            return view('permisos');
        }
        $data['prestamo'] = $this->prestamos
            ->select('prestamos.*, c.identidad, c.num_identidad, c.nombre AS cliente, c.apellido, c.telefono, c.whatsapp, c.correo, u.nombre AS usuario, u.apellido AS user_apellido')
            ->join('clientes AS c', 'prestamos.id_cliente = c.id')
            ->join('usuarios AS u', 'prestamos.id_usuario = u.id')
            ->where('prestamos.id', $id)->first();
---
SELECT `prestamos`.*, `c`.`identidad`, `c`.`num_identidad`, `c`.`nombre` AS `cliente`, `c`.`apellido`, `c`.`telefono`, `c`.`whatsapp`, `c`.`correo`, `c`.`direccion`, `u`.`nombre` AS `usuario`, `u`.`apellido` AS `user_apellido`
FROM `prestamos`
JOIN `clientes` AS `c` ON `prestamos`.`id_cliente` = `c`.`id`
JOIN `usuarios` AS `u` ON `prestamos`.`id_usuario` = `u`.`id`
WHERE `prestamos`.`id` = '1'
 LIMIT 1