app/Controllers/UsuariosController.php

    public function new()
    {
        if (!verificar('nuevo usuario', $this->session->permisos)) {
            return view('permisos');
        }
        $data['roles'] = $this->roles->where('estado', '1')->findAll();
---
SELECT *
FROM `roles`
WHERE `estado` = '1'

                }
            } else {
                $data['validacion'] = $this->validator;
                $data['roles'] = $this->roles->where('estado', '1')->findAll();
---
SELECT *
FROM `roles`
WHERE `estado` = '1'