app/Models/CajasModel.php

    public function calcularMovimientos($id_usuario) {
        $prestamos = new PrestamosModel();
        $inicial = $this->select('monto_inicial')->where([
            'estado' => '1',
            'id_usuario' => $id_usuario
        ])->first();

        $incialSaldo = (empty($inicial)) ? 0 : $inicial['monto_inicial'];

        $egreso = $prestamos->selectSum('importe')->where([
            'estado' => '1',
            'id_usuario' => $id_usuario
        ])->first();

        $detPrestamo = new DetPrestamoModel();
        $detalles = $detPrestamo
            ->select('detalle_prestamos.importe_cuota, detalle_prestamos.estado, p.importe, p.cuotas')
            ->join('prestamos AS p', 'detalle_prestamos.id_prestamo = p.id')
            ->where('p.id_usuario', $id_usuario)
            ->where('p.estado !=', '0')
            ->findAll();
---
SELECT `monto_inicial`
FROM `cajas`
WHERE `estado` = '1'
AND `id_usuario` = '1'
 LIMIT 1
SELECT SUM(`importe`) AS `importe`
FROM `prestamos`
WHERE `estado` = '1'
AND `id_usuario` = '1'
 LIMIT 1
SELECT `d`.`importe_cuota`, `d`.`estado`
FROM `prestamos`
JOIN `detalle_prestamos` AS `d` ON `prestamos`.`id` = `d`.`id_prestamo`
WHERE `prestamos`.`id_usuario` = '1'
AND `prestamos`.`estado` = '1'